; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	image2 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation6 - direction
	Star11 - direction
	GroundStation2 - direction
	GroundStation10 - direction
	Star9 - direction
	Star4 - direction
	Star5 - direction
	Star7 - direction
	Star0 - direction
	GroundStation3 - direction
	GroundStation8 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star7)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph0)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 image1)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 image1)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star9)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 Star4)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 GroundStation10)
	(supports instrument7 thermograph0)
	(supports instrument7 image1)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 Star5)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument8 image2)
	(supports instrument8 image1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 Star0)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation8)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet15)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(pointing satellite2 Star14)
	(pointing satellite4 Star4)
	(have_image Planet12 thermograph0)
	(have_image Phenomenon13 image1)
	(have_image Star14 thermograph0)
	(have_image Planet15 thermograph0)
))

)

; plan
1. (turn_to satellite2 star14 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 star14)
   goals met: 1 of 7
2. (turn_to satellite0 groundstation10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation10)
   goals met: 1 of 7
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 7
4. (calibrate satellite0 instrument2 groundstation10)
   added: (calibrated instrument2)
   goals met: 1 of 7
5. (turn_to satellite0 planet12 groundstation10)
   deleted: (pointing satellite0 groundstation10)
   added: (pointing satellite0 planet12)
   goals met: 1 of 7
6. (take_image satellite0 planet12 instrument2 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 2 of 7
7. (turn_to satellite0 phenomenon13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon13 instrument2 image1)
   added: (have_image phenomenon13 image1)
   goals met: 3 of 7
9. (turn_to satellite0 planet15 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet15)
   goals met: 3 of 7
10. (take_image satellite0 planet15 instrument2 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 4 of 7
11. (turn_to satellite0 star14 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star14)
   goals met: 4 of 7
12. (take_image satellite0 star14 instrument2 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 5 of 7
13. (turn_to satellite0 groundstation6 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation6)
   goals met: 6 of 7
14. (turn_to satellite4 star4 planet15)
   deleted: (pointing satellite4 planet15)
   added: (pointing satellite4 star4)
   goals met: 7 of 7
